Revit 2027 API
AnalysisDisplayStyle.SetName Method
 Set name of analysis display style element.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetName(
	string name
)
Public Sub SetName (
	name As String
)
public:
void SetName(
	String^ name
)
member SetName :
        name : string -> unit
Parameters
name String
 Analysis display style element name to be set.
Exceptions
Exception | Condition
ArgumentException |  name is not unique in document.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace